<?php

namespace App\Classes\Sistema;

use Firebase\JWT\JWT;

/**
 * Clase para enviar mensajes entre sistemas
 *
 * @author ahfer
 */
class Mensaje
{
    // {{{ properties

    /*
     * @var string $sVar Propiedad
     */
    protected $sVar;

    // }}}}

    /**
     * --------------------------------------------------------------------------------------------------------
     * Métodos protegidos
     * --------------------------------------------------------------------------------------------------------
     */
    // {{{ protected functions

    // }}}

    /**
     * --------------------------------------------------------------------------------------------------------
     * Métodos privados
     * --------------------------------------------------------------------------------------------------------
     */
    // {{{ private functions

    // }}}

    /**
     * --------------------------------------------------------------------------------------------------------
     * Métodos públicos
     * --------------------------------------------------------------------------------------------------------
     */
    // {{{ public functions

    /**
     * Constructor
     */
    public function __construct()
    {
        // Ejecuta constructor padre
        parent::__construct();
    }

    // }}}
}